# მოიძიეთ ინფორმაცია case-ბის შესახებ და მიუწერეთ რომელ პროგრამირების ენებში იყენებენ
# შემდეგი 4 ოპერატორის გამოყენებით: +, -, *, / -როგორ მოვახდენთ შემოკლებით ცვლადის მნიშვნელობის განახლებას? ჩამოწერეთ პასუხები. თუ არ გაგახსენდებათ, გადახედეთ პირველ საკლასო დავალებას

num1=10
num2=12
num3=14
num4=16
print(num1 + num2 - num3 * num1 / num4) 


# შემდეგ 6 ოპერატორზე: +, -, *, /, %, **   ჩამოწერეთ შემოკლებულად ცვლადის განახლების 10-10 მაგალითი

num1=50
num2=100
num3=10
num4=570
print(num4+num3)
print(num3+num2)
print(num1**num4)
print(num3+num2)
print(num1*num2)
print(num4/num2)
print(num1-num4)
print(num2/num2)
print(num4-num2)

# თქვენი სიტყვებით ახსენით რა არის debugging და რამდენი ნაწილისგან შედგება, ასევე ამ საკითხზე გააკეთეთ ნახაზი paint-ში
# debugging-არის error-ს გასწორება (შეცდომების გასწორება კოდში)


# შექმენით ერთი ცვლადი, რომელსაც 5-ჯერ შეუცვლით მნიშვნელობას და საბოლოოდ დაბეჭდავთ მის მნიშვნელობას

number1=1
number1=10
number1=100
number1=1000
number1=10000
number1=100000

print(number1)

# თქვენი სიტყვებით ახსენით რას ნიშნავს case-sensitive და case-insensitive
# case-sensitive-წერის დროს აქვს მნიშვნელობა დიდი ასეობით გვეწერება თუ პატარა ასოებით
# case-insensitive-არ აქვს მნიშვნელობა დიდ სიმბოლოებს გამოვიყენებთ თუ პატარა სიმბოლოებს წერის დროს


# ჩამოწერეთ 3 case-insensitive პროგრამირების ენა/ტექნოლოგია და 3 case-sensitive პროგრამირების ენა/ტექნოლოგია, ასევე გააკეთეთ ნახაზი paint-ში

'''
Case-insensitive:
BASIC
SQL
HTML
Case-sensitive:
Python
Java
C++
'''

