'''
შექმენით ფუნქცია სახელად greet, რომელსაც ექნება 1 პარამეტრი.
ფუნქციის გამოძახებისას არგუმენტად გადაეცით თქვენი სახელი და
ფუნქციამ ასეთი რამ უნდა დაგიბეჭდოთ: "გამარჯობა, {აქ თქვენი სახელი}"
'''
def greet(name):
    print(f"გამარჯობა, {name}")



'''
საკლასო დავალება: შექმენით ფუნქცია სახელად manual_range,
რომელსაც გადაეცემა სამი პარამეტრი (start, end, step).
ფუნქციის დავალებაა რომ გადაცემული პარამეტრებით შეადგინოს დიაპაზონი,
შემდეგ ამ დიაპაზონს გადავუაროთ ციკლით და დავბეჭდოთ მხოლოდ ლუწი რიცხვები.
ფუნქციის გამოძახებისას მას აუცილებლად უნდა გადაეცეს 3 არგუმენტი.
ფუნქცია გამოიძახეთ მინიმუმ 5-ჯერ სხვადასხვა არგუმენტებით
'''
def manual_range(start, end, step):
    for num in range(start, end, step):
        if num % 2 == 0:
            print(num)



'''
საკლასო დავალება: შექმენით ფუნქცია სახელად manual_len,
რომელსაც ექნება გაწერილი 1 პარამეტრი.
ფუნქციას გადაეცემა სია და მისი დავალებაა რომ დააბრუნოს სიის სიგრძე
(len არ გამოიყენოთ). უნდა გამოიყენოთ for ან while ციკლი და ერთი ცვლადი.
საბოლოოდ დაბეჭდეთ სიის სიგრძე.
ფუნქციის გამოძახებისას გადაეცემა მას ერთი არგუმენტი - სია
'''
def manual_len(my_list):
    length = 0
    for item in my_list:
        length += 1
    print(length)