# თქვენი სიტყვებით ახსენით რა არის ციკლი და იტერაცია
# იტერაცია არის რაღაცის განმეორება
# ციკლი არის:(for loop ;while loop)

# შექმენით დიაპაზონი 20-დან 50-მდე და შეინახეთ ცვლადში
range_20_50 = list(range(20 ,51))
print(range_20_50)

# შექმენით დიაპაზონი 100-დან 150-მდე და შეინახეთ ცვლადში
range_100_150 = list(range(100 ,151))
print(range_100_150)

# შექმენით 20-დან 50-მდე ლუწი რიცხვების დიაპაზონი და შეინახეთ ცვლადში
even_20_50 = list(range(20 , 51 , 2))
print(even_20_50)

# შექმენით 11-დან 31-მდე კენტი რიცხვების დიაპაზონი და შეინახეთ ცვლადში
odd_11_31 = list(range(11 , 32 , 2))
print(odd_11_31)

# for ციკლით 10-ჯერ დაბეჭდეთ თქვენი სახელი და გვარი
for i in range(10):
    print("nikuradze biba")

# 10-დან 30-მდე დაბეჭდეთ ყველა რიცხვი გაყოფილი 2-ზე
for i in range(10 ,31 ):
    print(i / 2)

# 40-დან 60-მდე დაბეჭდეთ ყველა რიცხვის მესამე ხარისხი
for i in range(40 , 60):
    print( i )
# 5-ჯერ შეეკითხეთ მომხმარებელს რიცხვი და ხუთივეჯერ დაბეჭდეთ. შეასრულეთ ციკლით, პირდაპირ დაწერილი არ ითვლება
for i in range(5):
    user_num = int(input("Enter your number: "))
    print(user_num)


# მომხმარებელს შეეკითხეთ სახელი და მოახდინეთ მასზე იტერაცია for ციკლით, დაბეჭდეთ სახელის თითოეული ასო
name = input("Enter your name: ")
for x in name:
    print(x)

name = "chad"
# 1) i = "c"
# 2) i = "h"
# 3) i = "a"
# 4) i = "d"


# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num1 ცვლადში მთელი რიცხვის სახით.
# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num2 ცვლადში მთელი რიცხვის სახით.
# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num3 ცვლადში მთელი რიცხვის სახით.
# შექმენით შემდეგი დიაპაზონი: range(num1, num2, num3)
# გადაუარეთ ამ დიაპაზონს for ციკლით და დაბეჭდეთ საიტერაციო ცვლადის კვადრატები

# რიცხვების შენახვა
num1 = int(input("Enter number: "))
num2 = int(input("Enter number: "))
num3 = int(input("Enter number: "))

# დიაპაზონის შექმნა
range1 = range(num1, num2, num3)

# for ციკლის კოდი
for i in range1:
    print(i**2)