name=10
print(type(name))

# პითონში მონაცემები იყოფა int. str. float. complex.
# int. -ს ვიყენებთ მათემატიკური ოპერაციებისთვის და რიცხვებისთვის
# str. -ს ვიყენებთ ტექსტური მონაცემის გამოსატანად
# float. -ს ვიყენებთ ისევ რიცხვებისთვის ოღონდ რომელ რიცხვებშიც არის ნაშთი
# complex. - ფორმატი არის a + bj სადაც a და b  არის რიეალური რიცხვები, ხოლო j არის კომპლექსური ნაწილაკი მაგ:2+3j

# print-ში / და % სხვადასხვა ფუნქციას ასრულებენ. მათი მნიშვნელობა ასე გამოიყურება:
# / ოპერატორი (გაყოფა) ეს ოპერატორი გამოიყენება ორი რიცხვის გაყოფისთვის შედეგი ყოველთვის იქნება float   
num1=10/3 # 0.3335
# % ოპერატორი (ნაშთიანი გაყოფა) ეს ოპერატორი აგრძელებს გაყოფის პროცესს მაგრამ ეს არის ნაშთი, რომელიც რჩება გაყოფის შემდეგ
num2=10%3 # 1

#  მოცემულ ექვს ოპერატორზე: +, -, *, /, %, **   ჩამოწერეთ 3-3 მაგალითი
num=10+10
num=5+20
num=20+6
num=10-5
num=70-55
num=46-18
num=2*2
num=10*5
num=30*2
num=10/2
num=46/4
num=100/50
num=10%3
num=20%7
num=66%30
num=10**2
num=40**5
num=40**8

# შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს.
# შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა გამოთვალოთ წინა ცვლადის ტემპერატურა ფარენჰეიტში რამდენი იქნება.
celsius = 30

fahrenheit = int((30 * 9 / 5) + 32)

print(fahrenheit)

# შექმენით თქვენი ოჯახის წევრების ასაკებისგან ცვლადები,
# დააფდეითეთ მათი მნიშვნელობები ახალ ცვლადებში - დაუწერეთ 20 წლის შემდეგ რა იქნება და დაპრინტეთ ახალი ცვლადების მნიშვნელობები

age1=15
age2=9
age3=45
age4=42

new_age1=age1 + 20
new_age2=age2 + 20
new_age3=age3 + 20
new_age4=age4 + 20
print(new_age1)
print(new_age2)
print(new_age3)
print(new_age4)